app/controllers/batches_controller.rb

SELECT * FROM "batches"
---
  def index
    @batches = Batch.all

SELECT * FROM "batches" WHERE ("batches"."id" = 1)
---
  def show
    @batch = Batch.find(params[:id])

SELECT * FROM "batches" WHERE ("batches"."id" = 6)
---
  def edit
    @batch = Batch.find(params[:id])

INSERT INTO "batches" ("name", "contact_person", "created_at", "sequencing", "updated_at", "submit_date", "grp_leader", "preparation", "collect", "sample_type", "samp_no", "extraction", "suspension", "batch_comment", "cleanup") VALUES('', '', '2011-07-02 15:37:07', NULL, '2011-07-02 15:37:07', '2011-07-02', '', NULL, NULL, NULL, 4, '', '', '', '')
---
  def create
    @batch = Batch.new(params[:batch])

    respond_to do |format|
      if @batch.save

SELECT * FROM "batches" WHERE ("batches"."id" = 6)
UPDATE "batches" SET "cleanup" = '', "updated_at" = '2011-07-02 11:48:18', "extraction" = '', "contact_person" = '', "submit_date" = '2011-07-02', "suspension" = '', "grp_leader" = '' WHERE "id" = 9
---
  def update
    @batch = Batch.find(params[:id])

    respond_to do |format|
      if @batch.update_attributes(params[:batch])

SELECT * FROM "batches" WHERE ("batches"."id" = 1)
DELETE FROM "batches" WHERE "id" = 1
---
  def destroy
    @batch = Batch.find(params[:id])
    @batch.destroy