app/controllers/lab_controller.rb

SELECT * FROM "batches" ORDER BY submit_date
---
  def index
    @batches = Batch.find_batches_to_show

SELECT * FROM "batches" WHERE ("batches"."id" = 17)
---
  def view_progress
    batch = Batch.find(params[:id])

SELECT * FROM "batches" WHERE ("batches"."id" = 17)
---
  def samp_detail
    batch = Batch.find(params[:id])