app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 3)
---
  def show
     @user = User.find(params[:id])

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('Graham', '3f5c52cc821278e0366b6bb4c3534a40948443f152312adeeed886953af353a9', 'd8f7565adf63a8987c11303c96965311801135fcdf56c2dcfe66ed331d4dc1ff', '2011-07-18 10:53:58', '2011-07-18 10:53:58', NULL, 'g@mail.com')
---
   def create
     @user = User.new(params[:user])
     if @user.save

UPDATE "users" SET "updated_at" = '2011-07-18 14:33:18', "encrypted_password" = '4cec369bdc33561da11dbc4dddb778dc2a939938a2232ea8a3b3da01b96f134c', "salt" = '2800291fb59e5b6fdd3e9db19bd82e288984fe07908b33a813efc8289046aed0' WHERE "id" = 13
---
  def update
    if @user.update_attributes(params[:user])

SELECT * FROM "users" ORDER BY email
---
  def index
    @title = "All users"
    @users = User.all

DELETE FROM "users" WHERE "id" = 2
SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def destroy
    User.find(params[:id]).destroy